app/controllers/courses_controller.rb

SELECT * FROM `courses` WHERE (`courses`.`id` = 4)
---
  def show
    @course = Course.find(params[:id])

SELECT * FROM `courses` WHERE (`courses`.`id` = 4)
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO `courses` (`name`, `created_at`, `updated_at`, `course_number`, `course_code_id`) VALUES('Data Structures', '2009-11-14 18:18:04', '2009-11-14 18:18:04', 210, 2)
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

SELECT * FROM `courses` WHERE (`courses`.`id` = 4)
---
  def update
    @course = Course.find(params[:id])