app/controllers/friendships_controller.rb

  def create
     @friendship = current_person.friendships.build(:friend_id => params[:friend_id])
     if @friendship.save
---
INSERT INTO `friendships` (`person_id`, `friend_id`, `created_at`, `updated_at`) VALUES(4, 4, '2009-11-21 21:50:46', '2009-11-21 21:50:46')

   def destroy
      @friendship = current_person.friendships.find(params[:id])
      friend_name= @friendship.friend.full_name
      @friendship.destroy
---
SELECT * FROM `friendships` WHERE (`friendships`.`id` = 1 AND (`friendships`.person_id = 4))
DELETE FROM `friendships` WHERE `id` = 1