app/controllers/places_controller.rb

  def show
    @place = Place.find(params[:id])
---
SELECT * FROM `places` WHERE (`places`.`id` = 12)

  def create
    @place = Place.new(params[:place])

    respond_to do |format|
      if @place.save
---
INSERT INTO `places` (`place_name`, `type_id`, `location_id`, `created_at`, `updated_at`) VALUES('Lab 671', 1, NULL, '2009-11-14 18:16:53', '2009-11-14 18:16:53')